Revit 2027 API
Rebar.GetMovedBarTransform Method
 Returns a transform representing the movement of the bar relative to its default position along the distribution path.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetMovedBarTransform(
	int barPositionIndex
)
Public Function GetMovedBarTransform (
	barPositionIndex As Integer
) As Transform
public:
Transform^ GetMovedBarTransform(
	int barPositionIndex
)
member GetMovedBarTransform :
        barPositionIndex : int -> Transform
Parameters
barPositionIndex Int32
 The bar index.
Return Value
Transform
 The transform representing the movement of the bar relative to its default position along the distribution path.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPositionIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPositionIndex should be included.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace